blogs/how-many-ifs-are-too-many.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-09-09 六 22:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>多少if语句算多</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="zhengzhiyong" />
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">多少if语句算多</h1>
<p>
本文是 <a href="https://blog.cloudflare.com/branch-predictor/">Branch predictor: How many "if"s are too many? Including x86 and M1 benchmarks!</a> 的思考、阅读笔记。
</p>

<p>
本文提出了一个问题：不执行的if语句，影响性能吗？
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #00ffff;">if</span> (debug) {
  log(...);
}
</pre>
</div>

<div id="outline-container-org651a878" class="outline-2">
<h2 id="org651a878"><span class="section-number-2">1</span> 了解分支的耗时</h2>
<div class="outline-text-2" id="text-1">
<p>
对于现代CPU，一条分支指令大概需要1-20个cycle。分支可以分为：1. 无条件分支（x86的jmp）; 2. call/return; 3. 执行的条件分支; 4. 没执行的条件分支。
其中1、2、3都是执行的分支（taken branch）。
</p>

<p>
CPU的分支预测单元（BPU），可以在分支执行前，确定分支的目标（branch target）。BPU使用BTB（Branch Target Buffer）存放分支目标（和其它信息），显然它的大小很关键。
</p>
</div>
</div>

<div id="outline-container-orga2b67aa" class="outline-2">
<h2 id="orga2b67aa"><span class="section-number-2">2</span> 为什么需要分支预测</h2>
<div class="outline-text-2" id="text-2">
<p>
简单说，这是CPU性能要求的必然。没有分支预测，CPU的流水线、多发射、乱序执行就没法高效运转。
</p>

<pre class="example">
BR label_a;
    X1
    X2
label_a:
 	Y1
</pre>

<p>
CPU执行上面代码的逻辑，大概是这样的：
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">CPU cycle</th>
<th scope="col" class="org-left">前端</th>
<th scope="col" class="org-left">后端</th>
<th scope="col" class="org-left">说明</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left">读取BR指令</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">此时BR还没有解码</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">对BR解码，读取X1指令</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">此时前端可以等待BR的执行结果（branch target）或者取下一条指令</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">对X1解码，读取X2指令</td>
<td class="org-left">执行BR指令</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">读取Y1指令</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">CPU发现前端错了，根据BR的结果，重新取指令</td>
</tr>
</tbody>
</table>


<p>
在这个过程中，前端浪费了2个cycles（2和3）。分支越复杂，前端浪费的cycles越多。所以需要分支预测。
</p>
</div>
</div>

<div id="outline-container-orgd6cd4cb" class="outline-2">
<h2 id="orgd6cd4cb"><span class="section-number-2">3</span> BTB</h2>
<div class="outline-text-2" id="text-3">
<p>
可以写代码探测BTB的大小。在AMD EPYC 7642上得到一些结论（适用于无条件分支）。
</p>
<ol class="org-ol">
<li>成功的分支预测节约了7个cycles（预测成功，执行分支花费~3.4个cycles）;</li>
<li>在代码小于2k时，可能有uop缓存（uop是指令解码后的形式），预测成功的分支只要 ~1.5 cycles;</li>
<li>hot loop中的分支小于4096时，无论代码大小，成功预测的分支要 ~3.4个cycles;</li>
<li>hot loop中的分支大于4096时，分支要 ~10.5个cycles;</li>
<li>根据1、3、4推测BTB的大小是4096，大于4096时，分支预测总是失败;</li>
<li>热点代码函数调用不要多于2000（循环中的函数算一个，这里2000应该是指令地址），函数调用对应call/return两次分支，2000约是4096的一半;</li>
<li>没执行的条件分支几乎没有花销。</li>
</ol>
</div>
</div>

<div id="outline-container-org52f28c1" class="outline-2">
<h2 id="org52f28c1"><span class="section-number-2">4</span> 总结</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>x86上BTB只有4096个entries（应该和CPU的型号有关）;</li>
<li>热点代码小于16K（应该小于L1i就行，避免L1缓存miss）;</li>
<li>没执行的条件分支没有花销（但是条件的执行需要花销，例如：debug的值可能需要从内存load进缓存，这个花销可能不小）。</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: zhengzhiyong</p>
<p class="date">Created: 2023-09-09 六 22:27</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
